
. use nlswork.dta,clear
(National Longitudinal Survey.  Young Women 14-26 years of age in 1968)

. 
. iis idcode

. tis year

. 
. gen age2 = age^2
(24 missing values generated)

. gen ttl_exp2 = ttl_exp^2

. gen tenure2 = tenure^2
(433 missing values generated)

. gen byte black = race==2

. 
. * fixed-effects model

. xtreg ln_wage grade age age2 ttl_exp ttl_exp2 tenure tenure2 black not_smsa s
> outh, fe
note: grade omitted because of collinearity
note: black omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     28091
Group variable: idcode                          Number of groups   =      4697

R-sq:  within  = 0.1727                         Obs per group: min =         1
       between = 0.3505                                        avg =       6.0
       overall = 0.2625                                        max =        15

                                                F(8,23386)         =    610.12
corr(u_i, Xb)  = 0.1936                         Prob > F           =    0.0000

------------------------------------------------------------------------------
     ln_wage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       grade |          0  (omitted)
         age |   .0359987   .0033864    10.63   0.000     .0293611    .0426362
        age2 |   -.000723   .0000533   -13.58   0.000    -.0008274   -.0006186
     ttl_exp |   .0334668   .0029653    11.29   0.000     .0276545     .039279
    ttl_exp2 |   .0002163   .0001277     1.69   0.090    -.0000341    .0004666
      tenure |   .0357539   .0018487    19.34   0.000     .0321303    .0393775
     tenure2 |  -.0019701    .000125   -15.76   0.000    -.0022151   -.0017251
       black |          0  (omitted)
    not_smsa |  -.0890108   .0095316    -9.34   0.000    -.1076933   -.0703282
       south |  -.0606309   .0109319    -5.55   0.000    -.0820582   -.0392036
       _cons |    1.03732   .0485546    21.36   0.000     .9421496     1.13249
-------------+----------------------------------------------------------------
     sigma_u |  .35562203
     sigma_e |  .29068923
         rho |  .59946283   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(4696, 23386) =     6.65         Prob > F = 0.0000

. predict e_fe, e
(443 missing values generated)

. predict ue_fe, ue
(443 missing values generated)

. 
. * Random-effects model 

. xtreg ln_wage grade age age2 ttl_exp ttl_exp2 tenure tenure2 black not_smsa s
> outh, re

Random-effects GLS regression                   Number of obs      =     28091
Group variable: idcode                          Number of groups   =      4697

R-sq:  within  = 0.1715                         Obs per group: min =         1
       between = 0.4784                                        avg =       6.0
       overall = 0.3708                                        max =        15

                                                Wald chi2(10)      =   9244.74
corr(u_i, X)   = 0 (assumed)                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
     ln_wage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       grade |   .0646499   .0017812    36.30   0.000     .0611589    .0681409
         age |   .0368059   .0031195    11.80   0.000     .0306918    .0429201
        age2 |  -.0007133     .00005   -14.27   0.000    -.0008113   -.0006153
     ttl_exp |   .0290208    .002422    11.98   0.000     .0242739    .0337678
    ttl_exp2 |   .0003049   .0001162     2.62   0.009      .000077    .0005327
      tenure |   .0392519   .0017554    22.36   0.000     .0358113    .0426925
     tenure2 |  -.0020035   .0001193   -16.80   0.000    -.0022373   -.0017697
       black |   -.053053   .0099926    -5.31   0.000    -.0726381   -.0334679
    not_smsa |  -.1308252   .0071751   -18.23   0.000    -.1448881   -.1167622
       south |  -.0868922   .0073032   -11.90   0.000    -.1012062   -.0725781
       _cons |   .2387207    .049469     4.83   0.000     .1417633    .3356781
-------------+----------------------------------------------------------------
     sigma_u |  .25790526
     sigma_e |  .29068923
         rho |  .44045273   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. predict e_re, e
(443 missing values generated)

. predict ue_re, ue
(443 missing values generated)

. predict u_re, u
(443 missing values generated)

. 
. summarize e_fe ue_fe e_re ue_re u_re

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        e_fe |     28091    2.57e-11    .2652351  -1.918056   3.027837
       ue_fe |     28091    1.59e-11    .4149874  -1.781829   3.565999
        e_re |     28091   -2.39e-11      .27231  -1.862328   3.108852
       ue_re |     28091    .0058431    .3791907  -2.059491   3.786081
        u_re |     28091    .0058431    .2220013  -1.176337   1.032857

. list e_fe ue_fe e_re ue_re u_re in 1/10

     +----------------------------------------------------------+
     |      e_fe       ue_fe        e_re       ue_re       u_re |
     |----------------------------------------------------------|
  1. | -.4252672   -.0393071   -.3803626     .023301   .4036635 |
  2. | -.8636432   -.4776832   -.8190892   -.4154257   .4036635 |
  3. |  -.371813    .0141471   -.3272774    .0763861   .4036635 |
  4. | -.1617081     .224252   -.1152563    .2884072   .4036635 |
  5. | -.1922358    .1937242   -.1466973    .2569663   .4036635 |
     |----------------------------------------------------------|
  6. | -.2713343    .1146258   -.2290637    .1745999   .4036635 |
  7. |  .4883661    .8743262    .5345064    .9381699   .4036635 |
  8. |  .4451077    .8310678    .4878222    .8914858   .4036635 |
  9. |  .3695945    .7555546    .4121574     .815821   .4036635 |
 10. |  .4782678     .864228    .5199476    .9236112   .4036635 |
     +----------------------------------------------------------+

. 
. 
. 